chore: updated documents on md spec
